Repository: manaflow-ai/cmux
Catalog: webviews/src/pages/editor/Localizable.xcstrings
Source language: en
Languages: ja

# conflict.changed
source: The file changed on disk.
ja: ディスク上のファイルが変更されました。

# conflict.deleted
source: The file was deleted on disk.
ja: ディスク上のファイルが削除されました。

# conflict.keep
source: Keep My Changes
ja: 自分の変更を保持

# conflict.reload
source: Reload
ja: 再読み込み

# editor.label
source: Editor, %@
ja: エディタ、%@

# empty.choose
source: Choose File…
ja: ファイルを選択…

# empty.drop
source: Drop a file to open it
ja: ドロップしてファイルを開く

# empty.recents
source: Files you open appear here.
ja: 開いたファイルがここに表示されます。

# empty.subtitle
source: View and edit a text file. Choose a file, pick a recent one, or drop a file here.
ja: テキストファイルを表示・編集します。ファイルを選ぶか、最近のファイルを選ぶか、ここにドロップします。

# empty.title
source: Open a file
ja: ファイルを開く

# language.plain
source: Plain Text
ja: プレーンテキスト

# large.notice
source: Large file: highlighting, minimap and folding are off.
ja: 大きなファイル：ハイライト、ミニマップ、折りたたみはオフです。

# page.disconnected
source: Not connected to cmux.
ja: cmux に接続されていません。

# page.failed
source: The file could not be opened.
ja: ファイルを開けませんでした。

# page.loading
source: Loading…
ja: 読み込み中…

# page.retry
source: Retry
ja: 再試行

# page.title
source: Editor
ja: エディタ

# picker.empty
source: No folders or files here
ja: フォルダやファイルはありません

# picker.title
source: Choose a file
ja: ファイルを選択

# readOnly.binary
source: This file looks binary, so it is read only.
ja: このファイルはバイナリのようなので、読み出し専用です。

# readOnly.encoding
source: This file is not UTF-8 text, so it is read only.
ja: このファイルは UTF-8 テキストではないため、読み出し専用です。

# readOnly.outside
source: This file is outside the workspace, so it is read only.
ja: このファイルはワークスペースの外にあるため、読み出し専用です。

# readOnly.permission
source: This file cannot be written, so it is read only.
ja: このファイルには書き込めないため、読み出し専用です。

# status.edited
source: Edited
ja: 編集済み

# status.failed
source: Not saved
ja: 保存されていません

# status.mixed
source: Mixed line endings
ja: 混在した改行

# status.position
source: Ln %1$@, Col %2$@
ja: %1$@ 行、%2$@ 列

# status.readOnly
source: Read only
ja: 読み出し専用

# status.saved
source: Saved
ja: 保存済み

# status.saving
source: Saving…
ja: 保存中…

# status.spaces
source: Spaces: %@
ja: スペース: %@

# status.tabs
source: Tab Size: %@
ja: タブのサイズ: %@

# status.utf8Bom
source: UTF-8 with BOM
ja: UTF-8（BOM 付き）

# toolbar.minimap
source: Minimap
ja: ミニマップ

# toolbar.wordWrap
source: Word Wrap
ja: 折り返し
